# -*- coding: utf-8 -*-

# 9.1 Предположим , к предметам добавился еще один: МРЗ-плеер. Он весит
# 1 фунт и стоит $1000. Стоит ли брать его?

# ответ - нет. гитара уже стоит 1500 и весит 1 (wrong - можно положить
# плеер айфон и гитару)

# 9.2  Предположим, что вы собираетесь в турпоход. Емкость вашего рюкзака
# составляет 6 фунтов, и вы можете взять предметы из следующего
# списка . У каждого предмета имеется стоимость; чем она выше, тем
# важнее предмет :
# Q вода, 3 фунта, 1 О;
# Q книга, 1 фунт, 3;
# Q еда, 2 фунта, 9;
# Q куртка, 2 фунта, 5;
# Q камера, 1 фунт, 6
# Как выглядит оптимальный набор предметов для похода?

# ответ - вода еда камера (жадным алгоритмом)

# 9.3 Нарисуйте и заполните таблицу для вычисления самой длинной об щей
# подс троки между строками Ыие и clues

# ответ в тетрадке ( и он верный)