# -*- coding: utf-8 -*-

# 3.1 Предположим, имеется стек вызовов следующего вида:
#
#     GREET2
# NAME:   MAGGIE
#     GREET
# NAME:   MAGGIE
#
# Что можно сказать о текущем состоянии программы на основании этого
# стека вызовов?

# ответ
# была вызвана функция GREET2 внутри функции GREET

# 3.2 Предположим, вы случайно написали рекурсивную функцию, которая
# бесконечно вызывает саму себя . Как вы уже видели, компьютер выделяет
# память в стеке при каждом вызове функции . А что произойдет
# со стеком при бесконечном выполнении рекурсии?

# ответ
# стэк переполнится?
