# -*- coding: utf-8 -*-

# 6.1 Найдите длину кратчайшего пути от начального до конечного узла .

# ответ: через верх. Длина 2. Сравниваем верх и низ. Потом смотрим их узлы на "конец"

# 6.2 Найдите длину кратчайшего пути от «саЬ» к «bat».

# ответ: смотрим car и cat, они не bat. Дальше смотрим узлы от cat: mat и bat.
# bat - то что надо. cab -> cat -> bat

# 6.3 там граф утреннего распорядка

# ответ: А - недействителен, Б - действителен, В - действителен. (В - недействительный)

# 6.4 более сложный граф

# ответ: проснуться, упаковать обед, почистить зубы, сделать зарядку, принять душ,
# позавтракать и одеться. да как угодно, главное, чтобы последовательность была

# 6.5 Какие из следующих графов также являются деревьями?

# ответ
# А и С